nine_cats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["description", "Soggie was a very wet cat."], ["updated_at", "2018-09-11 22:14:21.575823"], ["id", 4]]
---
  def update
    @cat = Cat.find_by(id: params[:id])
    if @cat.update_attributes(cat_params)