nine_cats/app/models/cat_rental_request.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1  [["cat_id", 12]]
---
  def overlapping_requests
    # find rental requests of specific cat_id
      # all of the rental requests / confirmations for specific cat
    # return grayed out dates
    # see if our date overlaps
    our_start = self.start_date
    our_end = self.end_date
    cat = Cat.find(self.cat_id)

    cat.cat_rental_requests.each do |request|