nine_cats/app/views/cat_rental_requests/_form.html.erb

    <option disabled>-- Select a Cat, yo. --</option>
    <% Cat.all.each do |cat| %>
---
SELECT "cats".* FROM "cats"